{
  "id": 558449,
  "page": 1,
  "results": [
    {
      "author": "Manuel São Bento",
      "author_details": {
        "name": "Manuel São Bento",
        "username": "msbreviews",
        "avatar_path": null,
        "rating": 8
      },
      "content": "FULL SPOILER-FREE REVIEW @ https://talkingfilms.net/gladiator-ii-review-a-legacy-sequel-that-triumphs-through-spectacle-and-emotion/\r\n\r\n\"Gladiator II may not achieve the groundbreaking impact of the original film, but it remains an impressive cinematic experience, transporting audiences into an epic filled with emotional and visual grandeur.\r\n\r\nRidley Scott once again showcases his mastery in blending narrative, action, and thematic depth, delivering a sequel marked by superb technical execution and standout performances, particularly from Denzel Washington. Despite the inevitable comparisons to the classic, the iconic filmmaker presents a story that justifies its existence, even if it treads familiar ground.\r\n\r\nNecessary or not, what truly matters is the strength (and honor) with which a work captivates us - and here, Gladiator II triumphs.\"\r\n\r\nRating: A-",
      "created_at": "2024-11-14T08:50:23.907Z",
      "id": "6735b9cfffe3878e9e9f89ed",
      "updated_at": "2024-11-14T08:50:24.017Z",
      "url": "https://www.themoviedb.org/review/6735b9cfffe3878e9e9f89ed"
    },
    {
      "author": "Dean",
      "author_details": {
        "name": "Dean",
        "username": "Ditendra",
        "avatar_path": null,
        "rating": 1
      },
      "content": "Another Woke movie from Hollywood. There were never black (African) emperors in Roman empire... This movie is simply false propaganda.",
      "created_at": "2024-11-14T18:19:09.990Z",
      "id": "67363f1da102d269c03f0161",
      "updated_at": "2024-11-14T18:19:10.057Z",
      "url": "https://www.themoviedb.org/review/67363f1da102d269c03f0161"
    },
    {
      "author": "griggs79",
      "author_details": {
        "name": "",
        "username": "griggs79",
        "avatar_path": "/22j4jmDfV77WFPk2IeF3lXpSdsJ.jpg",
        "rating": 8
      },
      "content": "_Gladiator II_, a polished echo of the original, is a testament to Ridley Scott's cinematic powers. It follows his hit-and-miss _Napoleon_ biopic last year, which was rather miss than hit. The sequel captures the original's essence while introducing elements, making it a worthy successor.\r\n\r\nPaul Mescal in the lead role - inherited from the ever-growling Russel Crowe, who was at the top of his career in the original - holds his ground against Denzel Washington, whose charisma cleaves through the screen as effortlessly as his character's sword.\r\n\r\nRidley Scott admits he was prompted to revisit _Gladiator_ by the acclaim he received from those too young to have seen the original on the big screen. His mission to lure Gen Z away from their streaming devices may help to save cinema, ushering in a new era of appreciation for the big screen. But for the love of Jupiter, I hope they quickly learn that it isn't just a big iPad with comfy chairs. No pausing, swiping, mid-film selfies, dashes to the bar, or running commentary required. Screen four at your local cinema isn't the Colosseum but a place where the magic of film of this scale truly comes alive, offering a unique and immersive experience that can't be replicated at home.",
      "created_at": "2024-11-15T10:44:36.828Z",
      "id": "67372614c62c3a26ad055ce3",
      "updated_at": "2024-11-15T10:44:36.886Z",
      "url": "https://www.themoviedb.org/review/67372614c62c3a26ad055ce3"
    },
    {
      "author": "r96sk",
      "author_details": {
        "name": "",
        "username": "r96sk",
        "avatar_path": "/mwR7rFHoDcobAx1i61I3skzMW3U.jpg",
        "rating": 9
      },
      "content": "<em>'Gladiator II'</em> is awesome!\r\n\r\nI only watched the original three years ago, almost to the day in fact, but I was anticipating this follow-up after thoroughly loving the Russell Crowe film. Honestly, I think I kinda enjoyed this sequel more - at worst, the two are on the same level, for me anyway. Crowe is missed, though everyone in this movie more than makes up for his (obvious) absence.\r\n\r\nThis is the first time I've seen Paul Mescal act, despite knowing of him for quite a while now. I'm impressed! He delivers a showing of great strength (pardon the pun). Pedro Pascal is very good too, as is Joseph Quinn; I wasn't instantly sold on the latter when he appeared onscreen, though when all is said and done I rate his performance positively.\r\n\r\nDenzel Washington... what a geezer. I'll never tire or turn down the chance at seeing that man act. Needless to say, given he's one of two favourite actors of mine, I loved his performance all the way through. The likes of Fred Hechinger and Connie Nielsen merit fair praise as well, interesting to see Rory McCann and Matt Lucas in there too.\r\n\r\nOh, and the score... superb! Deafeningly grand.",
      "created_at": "2024-11-15T19:15:28.384Z",
      "id": "67379dd0ac9f3ba08155924f",
      "updated_at": "2024-11-15T19:15:28.471Z",
      "url": "https://www.themoviedb.org/review/67379dd0ac9f3ba08155924f"
    },
    {
      "author": "CinemaSerf",
      "author_details": {
        "name": "CinemaSerf",
        "username": "Geronimo1967",
        "avatar_path": "/yz2HPme8NPLne0mM8tBnZ5ZWJzf.jpg",
        "rating": 6
      },
      "content": "Sixteen years after \"Maximus\" (Russell Crowe) bit the dust, we find ancient Rome under the control of twins \"Geta\" (Joseph Quinn) and his brother \"Caracalla\" (Fred Hechinger) and thanks to their general \"Acacias\" (Pedro Pascal) continuing to expand their empire. It's this latter man who leads an attack on the home \"Nanno\" (Paul Mescal) shares with his wife \"Arishat\" (Yuval Gonen). That doesn't go so well and next thing, she's gone on ahead of him to the wheat fields and he's now a slave owned by the manipulative \"Macrinus\" (Denzel Washington) heading to the Colosseum to entertain the emperors and their cousin \"Lucilla\" (Connie Nielsen). What now ensues is a well produced and good looking rehash of the first film paying homage en route to \"Spartacus\" and it's the sheer predicability that I struggled with. It's episodically delivered with far too much script and though Mescal tries hard, his performance is largely charm-free and as wooden as a rudius, especially once the rather far-fetched familial back-story has been established. Sir Derek Jacobi sparingly appears as the other survivor from 2000 reprising his role as the senator \"Gracchus\" but to no real effect and the scene stealer for me is really only the megalomanic Quinn's imperial offering as he and his bonkers sibling teeter on the brink of inbred, sexually fluid, madness. Washington does well enough as the scheming slave-master, but he hasn't really enough to work with to stand out amongst what really are a mediocre collection of undercooked characters that just don't deliver any real sense of the hedonism and menace of this debauched and corrupt state. As with Sir Ridley Scott's \"Kingdom of Heaven\" (2005) the battle scenes are superb and action packed, as are the combat scenes in the vast marble auditorium filled with baying plebs and rhinos, but I am afraid that the shallow characterisations just didn't work well enough to keep this engaging and the plot was just too thin to stretch over a couple of hours that could have been so very much better. It really does need a big screen to appreciate the creatively crafted visuals, but I was still pretty disappointed, sorry.",
      "created_at": "2024-11-16T08:14:36.854Z",
      "id": "6738546ca181a717eac89458",
      "updated_at": "2024-11-16T08:14:36.970Z",
      "url": "https://www.themoviedb.org/review/6738546ca181a717eac89458"
    },
    {
      "author": "DWP",
      "author_details": {
        "name": "",
        "username": "DWP",
        "avatar_path": null,
        "rating": 7
      },
      "content": "Comparisons will be inevitable and Gladiator II will never be as iconic as the 2000 classic. However it is very good, strong all-around with gripping action and a well executed script. Performances are very good, with some pleasant surprises.",
      "created_at": "2024-11-19T17:32:10.445Z",
      "id": "673ccb9a08e8fd8518c96021",
      "updated_at": "2024-11-20T18:52:05.324Z",
      "url": "https://www.themoviedb.org/review/673ccb9a08e8fd8518c96021"
    },
    {
      "author": "Chris Sawin",
      "author_details": {
        "name": "Chris Sawin",
        "username": "ChrisSawin",
        "avatar_path": null,
        "rating": 5
      },
      "content": "Gladiator II features some impressive action sequences. Every battle in the Colosseum is fantastic despite how historically inaccurate they may be. The monkey sequence showcases how skilled Hanno (Paul Mescal) is not only as a fighter but also in how he interacts with others. Then there's the rhino sequence that plays out much like Bugs Bunny’s interactions with Toro the Bull in the Chuck Jones-directed Looney Tunes short Bully for Bugs (1953).\r\n\r\nWhile those sequences are fairly believable, the shark sequence seems like pure fantasy and that’s why it’s so incredible. They fill the Colosseum with water and let sharks loose while the opposing gladiators try to survive the onslaught on boats.\r\n\r\nIt’s also interesting to note that every major actor who dies in the film has a spectacular death. Not only that but these gruesome deaths get increasingly more grisly and memorable as the film progresses. These bloody triumphs rarely delve any deeper than someone getting shot with a bunch of arrows or a beheading or appendage severing of some kind. This level of brutality escalates throughout the film and eventually culminates with the most satisfying kill that takes two and a half hours to achieve.\r\n\r\nThe performances fluctuate between being top-tier perfection and mediocre overacting. Denzel Washington is having the time of his life as Macrinus. He has the most interesting storyline and Denzel dances in every scene with a giddiness that is unparalleled. Joseph Quinn seems to be acting in an entirely different film than everyone else as Emperor Geta. His mannerisms are operatic and theatrical with his wide eyes that rarely blink, grand body language and hand gestures, and explosive line delivery.\r\n\r\nPedro Pascal doesn’t do anything in Gladiator II as Marcus Acacius that he didn’t do in Game of Thrones apart from having more screen time. Much like how his character is written, Paul Mescal’s performance is muddled. The Hanno character and who he is is a poorly kept secret that consistently pulls the character in several directions.\r\n\r\nHanno is vengeful at first before succumbing to being the hero of the film and the evolution isn’t earned. The writing and pacing of Gladiator II feel like the film drops Hanno’s fate in his lap halfway through, which he’s either forgotten about over two decades or never knew until the audience did.\r\n\r\nConnie Nielsen, one of the few returning actors from the original film, is awful in this. Her acting in Gladiator II always comes off as forced as her crying scenes are often portrayed as constipated grunts with crocodile tears. Her dialogue delivery is also strained and broken despite being given some of the most important sequences of character connections and reawakenings of sorts in the sequel.\r\n\r\nCalling Gladiator II action-heavy is misleading because the film drags between every fight sequence. The film is largely dull and difficult to indulge during its quieter moments. The film is gorgeous with its incredible set pieces, intricate costume design, and impressive use of infinitely numerous extras. Director Ridley Scott reunites with all of the set decorators (Sonja Klaus, Crispian Sallis, and Emilio Ardura) and costume designer (Janty Yates) that he worked with on Gladiator in 2000. From a visual standpoint, Ridley Scott's films are highly detailed masterpieces.\r\n\r\nDenzel Washington’s extravagant performance makes Gladiator II worthwhile. Still, not even its excessively violent action sequences, beautiful cinematography, and masterful set and costume design can save the sequel from how boring it is. Ridley Scott waited over twenty years to make a sequel that is more than twice as expensive as the original only to rehash the same story points.",
      "created_at": "2024-11-20T01:01:33.492Z",
      "id": "673d34ed757b2842d9d8a184",
      "updated_at": "2024-11-20T01:01:33.681Z",
      "url": "https://www.themoviedb.org/review/673d34ed757b2842d9d8a184"
    }
  ],
  "total_pages": 1,
  "total_results": 7
}
